#include <stdio.h>
#include <stdlib.h>
#include <string.h>
int i;
char a[200];
char* p = a, * q = a, m, t, b;
char* positive_negative(char a[200])
{

	for (p = a; *p == '0'; ++p);                         //将指针p循环到第一个非0的数的位置。
	for (i = 0; *p != '\0'; ++i)                     //消去0的步骤。
	{
		a[i] = *(p++);                      //将第一个非0数拉到数组的第一的元素处，往后依次。
	}                                              //完成消0；
	a[i] = '\0';
	for (p = a; *p != '\0'; ++p)
	{
		if (!(*p - '.'))
		{
			for (p = a; *p != '.'; ++p);             //只留两位小数
			if (!(*(p + 1) - '\0'))
			{
				*(p + 1) = '0';
				*(p + 2) = '0';
			}
			if (!(*(p + 2) - '\0'))
			{
				*(p + 2) = '0';
			}
			*(p + 3) = '\0';
			for (p = a; *p != '.'; ++p);                //将p拉到小数点的位置
			for (i = 1; p != a; ++i, --p) {            //p每向前移动三个数字用逗号隔开（算法）
				if (!(i % 4 - 0)) {                   //用i变量找到要隔开的位置
					q = p;
					t = m = *q;
					for (; (m != '\0') && (t != '\0');) {         //遍历该位置后的所有元素，向后移动一个位置。
						m = *(++q);
						*q = t;
						t = *(++q);
						*q = m;
					}
					*(++q) = '\0';                                //在最后封住数组
					*p = ',';                                    //在p位置处用，隔开
					if (i >= 4) { ++i; }                        //因为之前为取余4，故用第一个逗号隔开之后，其后的会每隔4个数
				}                                              //加一个逗号，故给i加一使后面的每隔3个数加一个逗号，达到要求
			}
			break;
		}
	}
	if (*p == '\0')
	{
		for (i = 1; p != a; ++i, --p) {            //p每向前移动三个数字用逗号隔开（算法）
			if (!(i % 4 - 0)) {                   //用i变量找到要隔开的位置
				q = p;
				t = m = *q;
				for (; (m != '\0') && (t != '\0');) {         //遍历该位置后的所有元素，向后移动一个位置。
					m = *(++q);
					*q = t;
					t = *(++q);
					*q = m;
				}
				*(++q) = '\0';                                //在最后封住数组
				*p = ',';                                    //在p位置处用，隔开
				if (i >= 4) { ++i; }                        //因为之前为取余4，故用第一个逗号隔开之后，其后的会每隔4个数
			}                                              //加一个逗号，故给i加一使后面的每隔3个数加一个逗号，达到要求
		}
		for (; *p != '\0'; ++p);
		*(p++) = '.';
		*(p++) = '0';
		*(p++) = '0';
		*p = '\0';
	}return a;
}
int main(void)
{
	printf("please input a number :\n");
	scanf_s("%s", a, sizeof(a));
	printf("output the end number:\n");
	if (!(a[0] - '-'))
	{
		i = strlen(a);
		a[i] = '\0';
		for (i = 0; *p != '\0'; ++i)                           //去掉-的循环
		{
			a[i] = *(++p);
		}
		printf("(%s)\n", positive_negative(a));
	}
	else { printf("%s\n", positive_negative(a)); }
}
	/*else
	{
		i = strlen(a);
		a[i] = '\0';
		for (; *p == '0'; ++p);                           //将指针p循环到第一个非0的数的位置。
		for (i = 0; *p != '\0'; ++i)                     //消去0的步骤。
		{
			a[i] = *(p++);                              //将第一个非0数拉到数组的第一的元素处，往后依次。
		}                                              //完成消0；
		for (p = a; *p != '\0'; ++p)
		{
			if (!(*p - '.'))
			{
				for (p = a; *p != '.'; ++p);                 //只留两位小数
				*(p + 3) = '\0';
				for (p = a; *p != '.'; ++p);                //将p拉到小数点的位置
				for (i = 1; p != a; ++i, --p) {            //p每向前移动三个数字用逗号隔开（算法）
					if (!(i % 4 - 0)) {                   //用i变量找到要隔开的位置
						q = p;
						t = m = *q;
						for (; (m != '\0') && (t != '\0');) {         //遍历该位置后的所有元素，向后移动一个位置。
							m = *(++q);
							*q = t;
							t = *(++q);
							*q = m;
						}
						*(++q) = '\0';                                //在最后封住数组
						*p = ',';                                    //在p位置处用，隔开
						if (i >= 4) { ++i; }                        //因为之前为取余4，故用第一个逗号隔开之后，其后的会每隔4个数
					}                                              //加一个逗号，故给i加一使后面的每隔3个数加一个逗号，达到要求
				}
				printf("output the end number:\n");
				printf("%s\n", a);
				break;
			}
		}
		if(*p=='\0')  
		{
			for (i = 1; p != a; ++i, --p) {            //p每向前移动三个数字用逗号隔开（算法）
				if (!(i % 4 - 0)) {                   //用i变量找到要隔开的位置
					q = p;
					t = m = *q;
					for (; (m != '\0') && (t != '\0');) {         //遍历该位置后的所有元素，向后移动一个位置。
						m = *(++q);
						*q = t;
						t = *(++q);
						*q = m;
					}
					*(++q) = '\0';                                //在最后封住数组
					*p = ',';                                    //在p位置处用，隔开
					if (i >= 4) { ++i; }                        //因为之前为取余4，故用第一个逗号隔开之后，其后的会每隔4个数
				}                                              //加一个逗号，故给i加一使后面的每隔3个数加一个逗号，达到要求
			}
			printf("output the end number:\n");
			printf("%s.00\n", a);
		}
	}
}*/